# SkippedSegmentCurves Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainGridLine..::..SkippedSegmentCurves Property
CurtainGridLine Class See Also
---
Retrieve all the removed segment curves of the grid line.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurveArray SkippedSegmentCurves { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SkippedSegmentCurves As CurveArray
	Get
```

Visual C++
---
```text
public:
property CurveArray^ SkippedSegmentCurves {
	CurveArray^ get ();
}
```

# Remarks
User can get these curves and then call the method AddSegment() to add the segments to the grid line.
# See Also
CurtainGridLine Class
Autodesk.Revit.DB Namespace